//===========================================================================================================================
//===========================================================================================================================
//本文件实现设备检测功能
//创建者：steve
//创建日期：2018-06- 04
//创建版本：version-1.0
//修改日期：
//修改内容：
//修改版本：
//===========================================================================================================================
#include "config.h"
u16 systick_timer;
/**
  * @brief  SYSTICK callback.
  * @retval None
  */
void HAL_SYSTICK_Callback(void)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_SYSTICK_Callback could be implemented in the user file
   */
   if(systick_timer < 5000)
   {
       systick_timer++;
   }
}
void api_sys_timer_task(void)
{

}
/*********************************************************
                File End
*********************************************************/
